mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Devices.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  EFM8BB52F16G_QFN20
//  EFM8BB52F16G_QFN32
//  EFM8BB52F16G_TSSOP20
//  EFM8BB52F16G_TSSOP28
//  EFM8BB52F16I_QFN20
//  EFM8BB52F16I_QFN32
//  EFM8BB52F16I_TSSOP20
//  EFM8BB52F16I_TSSOP28
//  EFM8BB52F32G_QFN20
//  EFM8BB52F32G_QFN32
//  EFM8BB52F32G_TSSOP20
//  EFM8BB52F32G_TSSOP28
//  EFM8BB52F32I_QFN20
//  EFM8BB52F32I_QFN32
//  EFM8BB52F32I_TSSOP20
//  EFM8BB52F32I_TSSOP28

#ifndef SI_EFM8BB52_DEVICES_H
#define SI_EFM8BB52_DEVICES_H

#define EFM8BB52F16G_QFN20 0x02
#define EFM8BB52F16G_QFN32 0x04
#define EFM8BB52F16G_TSSOP20 0x01
#define EFM8BB52F16G_TSSOP28 0x03
#define EFM8BB52F16I_QFN20 0x0A
#define EFM8BB52F16I_QFN32 0x0C
#define EFM8BB52F16I_TSSOP20 0x09
#define EFM8BB52F16I_TSSOP28 0x0B
#define EFM8BB52F32G_QFN20 0x06
#define EFM8BB52F32G_QFN32 0x08
#define EFM8BB52F32G_TSSOP20 0x05
#define EFM8BB52F32G_TSSOP28 0x07
#define EFM8BB52F32I_QFN20 0x0E
#define EFM8BB52F32I_QFN32 0x10
#define EFM8BB52F32I_TSSOP20 0x0D
#define EFM8BB52F32I_TSSOP28 0x0F

#if (EFM8BB52_DEVICE == EFM8BB52F16G_QFN20)
#define DEVICE_DERIVID EFM8BB52F16G_QFN20
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16G_QFN32)
#define DEVICE_DERIVID EFM8BB52F16G_QFN32
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_QFN32 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16G_TSSOP20)
#define DEVICE_DERIVID EFM8BB52F16G_TSSOP20
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_TSSOP20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16G_TSSOP28)
#define DEVICE_DERIVID EFM8BB52F16G_TSSOP28
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_TSSOP28 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16I_QFN20)
#define DEVICE_DERIVID EFM8BB52F16I_QFN20
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16I_QFN32)
#define DEVICE_DERIVID EFM8BB52F16I_QFN32
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_QFN32 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16I_TSSOP20)
#define DEVICE_DERIVID EFM8BB52F16I_TSSOP20
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_TSSOP20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F16I_TSSOP28)
#define DEVICE_DERIVID EFM8BB52F16I_TSSOP28
#define DEVICE_FLASH_SIZE 0x3800
#define DEVICE_XRAM_SIZE 0x0400
#define DEVICE_PKG_TSSOP28 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32G_QFN20)
#define DEVICE_DERIVID EFM8BB52F32G_QFN20
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32G_QFN32)
#define DEVICE_DERIVID EFM8BB52F32G_QFN32
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_QFN32 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32G_TSSOP20)
#define DEVICE_DERIVID EFM8BB52F32G_TSSOP20
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_TSSOP20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32G_TSSOP28)
#define DEVICE_DERIVID EFM8BB52F32G_TSSOP28
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_TSSOP28 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32I_QFN20)
#define DEVICE_DERIVID EFM8BB52F32I_QFN20
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32I_QFN32)
#define DEVICE_DERIVID EFM8BB52F32I_QFN32
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_QFN32 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32I_TSSOP20)
#define DEVICE_DERIVID EFM8BB52F32I_TSSOP20
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_TSSOP20 1

#elif (EFM8BB52_DEVICE == EFM8BB52F32I_TSSOP28)
#define DEVICE_DERIVID EFM8BB52F32I_TSSOP28
#define DEVICE_FLASH_SIZE 0x7800
#define DEVICE_XRAM_SIZE 0x0800
#define DEVICE_PKG_TSSOP28 1

#endif

#endif // SI_EFM8BB52_DEVICES_H

//-eof--------------------------------------------------------------------------

